Repository: mozilla-l10n/mt-training-data
Catalog: azz/azz_pontoon.tmx
Source language: en_us
Languages: azz

source: Please enable JavaScript and try again.
azz: Se kualtakayot, xikaua maj peua tekiti JavaScript uan oksepa xikejeko.

source: Protect with password
azz: Xikyekpia ika se ichtakatajtol

source: Select files to upload
azz: Xikinixpejpena tajkuilolmej archivos tein tikintejkoltis

source: { -send-brand } lets you share files with end-to-end encryption and a link that automatically expires. So you can keep what you share private and make sure your stuff doesn’t stay online forever.
azz: { -send-brand } mitspaleuia uan ijkon tikinpanoltilis oksekin motajkuiloluan archivos ika tapoualmej tein amo aksa uelis kiajsikamatis, uan no kitemaka kampa se kipatskilis tein niman ixpoliui. Ijkuin uelis tikichtakaeuas tein tikintitanilis oksekin uan tikyekmatis tein moaxka amo nochipaya mokauas itech Internet.

source: { -send-brand } will not work with this browser. { -send-short-brand } works best with the latest version of { -firefox }, and will work with the current version of most browsers.
azz: { -send-brand } amo tekiti ika nejin navegador. { -send-short-brand } okachi kuali tekiti tein ika okachi yankuik { -firefox }, uan no tekitis tein ika okachi yankuikej tel miak navegadores.

source: { -send-short-brand } is brought to you by the all-new { -firefox }.
azz: Yankuik { -firefox } mitsixpantilia { -send-short-brand }.

source: { -send-short-brand } Privacy Notice
azz: { -send-short-brand } tanauatia ika yekpialis tein moaxka itech tepos

source: Share files up to { $size }
azz: Xikintitani tajkuilolmej archivos tein amo panouaj { $size }

source: Share files with more people
azz: Xikintitanili tajkuilolmej archivos oksekin

source: Share link
azz: Kampa se kipatskilis tein uelis tikinpanoltilis oksekin

source: Share the link to your file:
azz: Xikinpanoltili oksekin tein se kipatskilis uan teuika motajkuilol archivo:

source: Sign in
azz: Kampa se kalakteua

source: Sign in to send up to { $size }
azz: Xikalakteua uan uelis tiktitanis tein amo panos { $size }

source: Sign out
azz: Kampa se kisa

source: Simple, private file sharing
azz: Amo ouij uan ichtaka xikinpanoltili oksekin motajkuiloluan archivos

source: Something went wrong!
azz: ¡Tensa amo kuali kisak!

source: That file is too big to upload. It should be less than { $size }
azz: Nejin tajkuilol semi ueyi. Moneki amo panos { $size }

source: There is a way to protect your privacy. Join Firefox.
azz: Kemaj, uelis tikyekpias tein moaxka itech tepos. Xipoui Firefox.

source: This browser might not be able to decrypt a file this big.
azz: Xa navegador amo uelis kitalij nejin tajkuilol archivo tein tel ueyi kemej se uelis kiyekixtajtoltis ya.

source: This file was shared via { -send-brand } with end-to-end encryption and a link that automatically expires.
azz: Nejin archivo mopanoltij itechkopa { -send-brand } ika tapoualmej tein amo aksa uelis kiajsikamatis, uan no tein ika se kipatskilis tein niman ixpoliui.

source: This link has expired.
azz: Nejin tein tikpatskilij amo tekititos ok.

source: This password could not be set
azz: Nejin ichtakatajtol amo uel kiixtaliani

source: Total size: { $size }
azz: Nochi tamachiua: { $size }

source: Try Firefox Send
azz: Xikejeko Firefox Send

source: Try our favorite browser
azz: Xikejeko navegador tein semi techuelita

source: Try { -send-brand } for simple, safe file sharing.
azz: Xikejeko { -send-brand } ijkon amo ouij uelis tikinpanoltilis oksekin motajkuiloluan archivos uan tikyekmatis ke amo tej kipanos.

source: Unfortunately this version of Firefox does not support the web technology that powers Firefox Send. You’ll need to update your browser.
azz: Tetayokoltij, Firefox tein tikuitok amo kiselia tepostekitilis tecnología web tein ika tekiti Firefox Send. Moneki tikyankuilis monavegador.

source: Unlock
azz: Xikajchiua tein amo kikaua maj tekiti

source: Update Firefox
azz: Maj Firefox moyankuili

source: Upload
azz: Xiktejkolti

source: Version 1.0, dated March 12, 2019
azz: Versión 1.0 tein kikixtijkej 12 tonal metsti marzo 2019

source: Why does Firefox Send require JavaScript?
azz: ¿Keyej Firefox Send kineki maj moajsi JavaScript?

source: Why is my browser not supported?
azz: ¿Keyej nonavegador amo kualtia?

source: Your browser is not supported.
azz: Monavegador amo kualtia.

source: Your file is encrypted and ready to send
azz: Moarchivo moijkuiloj ya kemej amo akin uelis kiixtajtoltis uan se uelis kititanis ya
